## Reading / Wrting CSV, Excel Files In Notebook

**Topics:**
1. Read CSV
2. Write CSV
3. Read Excel
4. Write Excel

#### 1. Read CSV

In [29]:
import pandas as pd
csv_df=pd.read_csv("stockPrice.csv")
csv_df.head()

  ticker            eps  revenue price         people
0  GOOGL          27.82       87   845     larry page
1    WMT           4.61      484    65            n.a
2   MSFT             -1       85    64     bill gates
3   RIL   not available       50  1023  mukesh ambani
4   TATA            5.6       -1   n.a     Ratan Tata

###### In case you have extra row on the table and u want to skip that then use*

 example  
 1. csv_df=pd.read_csv("stockPrice.csv",skiprow=1)
 
 or
 2. csv_df=pd.read_csv("stockPrice.csv",header=1)
  
 ###### So if you don't have header to file then we can use this 
 
 example  
 3. csv_df=pd.read_csv("stockPrice.csv",header=None)
 
 if you want to gave specific name instead of numbers:-
 4. csv_df=pd.read_csv("stockPrice.csv",header=None, names=["ticker","eps","revenue","price","people" ])
 
###### if you have very big file and want to read only few lines of that file then 
 
 example 
 5. csv_df=pd.read_csv("stockPrice.csv", nrows=3)
 
 ###### if you want to replace na or not available file with NaN 
 example
 6. csv_df=pd.read_csv("stockPrice.csv", na_values=["not available","n.a"])

In [10]:
csv_df=pd.read_csv("stockPrice.csv", na_values=["not available","n.a"])
csv_df

  ticker    eps  revenue   price         people
0  GOOGL  27.82       87   845.0     larry page
1    WMT   4.61      484    65.0            NaN
2   MSFT  -1.00       85    64.0     bill gates
3   RIL     NaN       50  1023.0  mukesh ambani
4   TATA   5.60       -1     NaN     Ratan Tata

In case here the eps could be -1 but revenue can't be negtive so we cant gave -1 with not available or na becase it would chage the -1 in eps too so other option is listing

In [12]:
csv_df=pd.read_csv("stockPrice.csv", na_values={
    'eps':["not available","n.a"],
    'revenue':["not available","n.a",-1],
    'people':["not available","n.a"]
})
csv_df

  ticker    eps  revenue price         people
0  GOOGL  27.82     87.0   845     larry page
1    WMT   4.61    484.0    65            NaN
2   MSFT  -1.00     85.0    64     bill gates
3   RIL     NaN     50.0  1023  mukesh ambani
4   TATA   5.60      NaN   n.a     Ratan Tata

#### 2.Write back to CVS file

In [14]:
csv_df.to_csv("edited_stockPrice.csv", index=False)

In [16]:
csv_df.to_csv("edited_stockPrice1.csv",columns=['ticker','eps']) #to get specific columns in your file only

In [17]:
csv_df.to_csv("edited_stockPrice2.csv", header=False) #to remove the file header and save it

#### 3.  Reading Excel File

In [22]:
xlx_df = pd.read_excel("stockPrice.xlsx","Sheet1")
xlx_df.head(4)

  ticker            eps  revenue price         people
0  GOOGL          27.82       87   845     larry page
1    WMT           4.61      484    65            n.a
2   MSFT             -1       85    64     bill gates
3   RIL   not available       50  1023  mukesh ambani

Here for example you want to insert the name of the people instead of n.a simple example

In [27]:
def convert_people_cell(cell): #converter funtion to chage the name
    if cell=="n.a":
        return 'sam walton'
    return cell

def convert_eps_cell(cell):  #converter functon to change the eps
    if cell=="not available":
        return None
    return cell

xlx_df = pd.read_excel("stockPrice.xlsx","Sheet1", converters = {
    'people':convert_people_cell,
    'eps': convert_eps_cell
})
xlx_df.head(4)

  ticker    eps  revenue price         people
0  GOOGL  27.82       87   845     larry page
1    WMT   4.61      484    65     sam walton
2   MSFT  -1.00       85    64     bill gates
3   RIL     NaN       50  1023  mukesh ambani

#### 4. Write back to Execl file

In [31]:
xlx_df.to_excel("newstockPrice.xlsx",sheet_name="stockPrice")

In [32]:
xlx_df.to_excel("newstockPrice.xlsx",sheet_name="stockPrice",startrow=1, startcol=2)

In [36]:
xlx_df.to_excel("newstockPrice.xlsx",sheet_name="stockPrice",startrow=1, startcol=2, index=False)

**IF WE HAVE TWO DATAFRAMES THAT WE WANT TO WRITE IN TWO SHEETS OF EXCEL FILE**

In [46]:
#Two data frame one is weatherdata other is stock data
weather_data=pd.DataFrame({
    'day':['1/1/2022/','1/2/2022','1/3/2022','1/4/2022'],
    'temp': [8,9,10,7],
    'windspeed':[6,7,8,5],
    'event': ['rain','snow','rain','sunny']
})

xlx_df=pd.read_excel("newstockPrice.xlsx","stockPrice")

In [47]:
#with ExcelWriter we can write in  a stock file 
with pd.ExcelWriter('stocks_weather.xlsx') as writer:
    weather_data.to_excel(writer,sheet_name="weather")
    xlx_df.to_excel(writer,sheet_name="stocks")